<template>
    <div class="w-[50%] mx-auto flex justify-center flex-col mt-[10%]">
        <img src="/vite-drive.png" :class="'mx-auto w-[100px] mb-4'" />
        <h1 :class="'mx-auto mb-10'">Google Drive Demo</h1>
        <p>
            您承諾絕不為任何非法目的或以任何非法方式使用[google-drive-demo]，並承諾遵守中華民國相關法規及一切使用網際網路之國際慣例。 您若係中華民國以外之使用者，並同意遵守所屬國家或地域之法令。
            您同意並保證不得利用本服務從事侵害他人權益或違法之行為，包括但不限於：
            公布或傳送任何誹謗、侮辱、具威脅性、攻擊性、不雅、猥褻、不實、違反公共秩序或善良風俗或其他不法之文字、圖片或任何形式的檔案。
            侵害他人名譽、隱私權、營業秘密、商標權、著作權、專利權、其他智慧財產權及其他權利。 違反依法律或契約所應負之保密義務。 冒用他人名義使用本服務。 傳輸或散佈電腦病毒濫發廣告郵件。
            智慧財產權的保護 若您無合法權利得授權他人使用、修改、重製、公開播送、改作、散布、發行、公開發表某資料，並將前述權利轉授權第三人 準據法與管轄法院
        </p>
    </div>
</template>
<script setup lang="ts"></script>
<style scoped></style>
